{
  "backend": "tokenizers",
  "cls_token": "[CLS]",
  "do_lower_case": false,
  "extra_special_tokens": [
    "[PERSON]",
    "[/PERSON]",
    "[RELATIVE]",
    "[/RELATIVE]"
  ],
  "is_local": false,
  "mask_token": "[MASK]",
  "model_max_length": 512,
  "pad_token": "[PAD]",
  "sep_token": "[SEP]",
  "strip_accents": null,
  "tokenize_chinese_chars": true,
  "tokenizer_class": "BertTokenizer",
  "unk_token": "[UNK]"
}
