       IDENTIFICATION DIVISION.
       PROGRAM-ID. linkedlist.
       DATE-COMPILED. 2025/12/01.

       DATA DIVISION.

       LINKAGE SECTION.
       01  Linked-list-node BASED.
           05 node-data PIC X(50).
           05 next-ptr POINTER.

       WORKING-STORAGE SECTION.
           

       
       PROCEDURE DIVISION.

           STOP run.
       
       